<template>
  <div>
    <h3 id="footer-description" class="dy58-help-contents-item">Нижний колонтитул</h3>
    <p class="dy58-help-paragraph">
      Нижний колонтитул расположен в нижней части любой страницы ДУ-58.
      Состоит он из двух выпадающих списков:
    </p>
    <p class="dy58-help-paragraph">
      <i><b>Последние сообщения системы</b></i> - предназначен для просмотра сообщений, генерируемых ДУ-58.
      Максимальное количество таких сообщений указано в скобках. Сообщения системы сортируются и отображаются
      в обратном хронологическом порядке. Каждому сообщению предшествует дата и время его генерации.
      Сообщения в данном списке также дублируют сообщения, отображаемые во всплывающих уведомлениях (в частности, при
      издании документа, подтверждении получения документа и т.д.). Сообщения об ошибках отображаются красным
      цветом.
    </p>
    <p class="dy58-help-paragraph">
      <i><b>Состояние соединения с сервером</b></i> - предназначен для просмотра состояния соединения с сервером
      (Активно/Не активно + дата и время последнего перехода в данное состояние). Кроме того, отображаются
      последние сообщения, полученные от сервера (в обратном хронологическом порядке).
    </p>
  </div>
</template>

<script>
  export default {
    name: 'dy58-footer-description',
  }
</script>
