<template>
  <div>
    <h3 id="journal-page-description" class="dy58-help-contents-item">Страница "Журнал"</h3>
    <p class="dy58-help-paragraph">
      На данной странице есть возможность просмотреть Журнал диспетчерских распоряжений (в случае ДСП, ДНЦ) либо
      Оперативный журнал ЭЦД. В момент загрузки страницы по умолчанию подгружаются действующие в текущем месяце
      цепочки документов.
    </p>
    <p class="dy58-help-paragraph">
      Для изменения критериев поиска документов можно воспользоваться соответствующей панелью-слайдером
      <i><b>Определить параметры поиска информации</b></i>. На ней можно изменить временной промежуток поиска данных
      и определить критерии включения документов.
    </p>
    <p class="dy58-help-paragraph">
      <b><i>Временной промежуток поиска информации</i></b> определяется так:
      этот месяц (по умолчанию) либо иной промежуток времени, который можно
      установить вручную. При ручном задании времени поиска информации левую границу интервала поиска данных
      указывать обязательно, правую - нет. Если правая временная граница не указана и не установлен флаг
      "по настоящее время" либо флаг "по настоящее время" установлен, то полагается, что необходимо найти все документы,
      удовлетворяющие указанным дополнительным критериям поиска начиная с указанного времени.
    </p>
    <p class="dy58-help-paragraph">
      <b><i>Критерии включения документов</i></b> следующие: только исходящие документы - будут включены только документы, изданные
      на текущем рабочем полигоне; действующие цепочки документов - будут включены те цепочки документов, время
      которых (цепочек) находится в указанном временном промежутке.
    </p>
    <p class="dy58-help-paragraph">
      Панель поиска дополнительно содержит кнопки <i><b>"Найти"</b></i> и <i><b>"Найти и вывести на печать"</b></i>.
      Первая запускает поиск информации, удовлетворяющей указанным критериям, вторая делает то же самое, но с выводом
      результата в отдельном окне, при этом на странице присутствует только таблица с результатами поиска, которую
      можно вывести на печать средствами браузера.
    </p>
    <p class="dy58-help-paragraph">
      Внешний вид итоговой таблицы отличается у ДНЦ / ДСП и ЭЦД. Однако есть общие моменты:
    </p>
    <p class="dy58-help-paragraph">
      <b><i>сортировка</i></b> - возможна только по полям даты-времени; для сортировки по определенному полю в
      "шапке" соответствующего столбца необходимо нажать кнопку <i class="pi pi-sort-alt" style="text-indent:0"></i>;
      в "шапке" поля, по которому произведена сортировка, указанная кнопка становится синей;
      допустима одновременная сортировка только по одному полю;
    </p>
    <p class="dy58-help-paragraph">
      <b><i>поиск</i></b> - возможен по тем полям таблицы, в "шапке" которых присутствует кнопка
      <i class="pi pi-filter" style="text-indent:0"></i>; нажатие на данную кнопку приводит к появлению
      контекстного меню; данное меню содержит поле для ввода значения, которое необходимо найти в соответствующем
      поле таблицы, кнопки "Сброс" (сбрасывает фильтр по полю, если он установлен) и "Поиск" (запускает процесс
      поиска введенного значения); у полей, по которым произведен поиск, указанная кнопка становится синей;
      допустим одновременный поиск по нескольким полям;
    </p>
    <p class="dy58-help-text">
      в полях таблицы, в которых содержится только информация об адресатах документов / создателях, поиск
      производится лишь по отдельным составляющим информации; такими отдельными составляющими являются
      "наименование рабочего полигона", "должность", "ФИО"; например, если необходимо найти строки таблицы,
      в которых содержится значение "ДНЦ Минск-Орша", то сделать этого не получится, нужно искать отдельно
      значение "ДНЦ" и/или значение "Минск-Орша";
    </p>
    <p class="dy58-help-paragraph">
      <b><i>выделение записей</i></b> - в Журнале первый столбец таблицы для каждой записи содержит флажок,
      который позволяет выделить эту запись; при отправке Журнала на печать учитываются идентификаторы
      выделенных записей: если выделенных записей нет, то печатается вся информация, удовлетворяющая
      критериям поиска; если же выделенные записи есть, то печатаются только они.
    </p>
    <p class="dy58-help-paragraph">
      Отдельно отметим работу <b><i>ревизора</i></b> с Журналом.
      Данный работник, помимо указанного выше функционала, имеет
      также возможность вносить в Журнал записи о проверке. Для этой цели служит кнопка "Создать запись о проверке",
      расположенная на панели поиска. Доступна данная кнопка только принявшему дежурство ревизору!
      После нажатия на кнопку появляется диалоговое окно, в котором ревизор может лишь ввести содержание записи.
      Дата и время записи о проверке определяются моментом успешного сохранения данной записи в Журнале.
      В дальнейшем полагается, что все документы, которые изданы ранее этой даты, проверены.
      Для появления записи на странице в Журнале необходимо инициировать поиск информации.
      Запись ревизора выделяется в Журнале синим цветом, на печати - черным.
    </p>
    <p class="dy58-help-paragraph">
      При <b><i>автономной</i></b> работе с системой Журнал содержит только те документы, которые присутствовали
      в таблице Рабочих документов (распоряжений) последнего успешно входившего в систему пользователя, а также
      те документы соответствующего рабочего полигона, которые были изданы не более 48 часов назад.
    </p>
  </div>
</template>

<script>
  export default {
    name: 'dy58-journal-page-description',
  }
</script>
