<template>
  <div>
    <h3 id="journal-page-description" class="dy58-help-contents-item">Страница "Журнал"</h3>
    <p class="dy58-help-paragraph">
      На данной странице есть возможность просмотреть Журнал диспетчерских распоряжений (в случае ДСП, ДНЦ) либо
      Оперативный журнал ЭЦД. В момент загрузки страницы по умолчанию подгружаются действующие в текущем месяце
      цепочки документов.
    </p>
    <p class="dy58-help-paragraph">
      Для изменения критериев поиска документов можно воспользоваться соответствующей панелью-слайдером
      <i><b>Определить параметры поиска информации</b></i>. На ней можно изменить временной промежуток поиска данных
      и определить критерии включения документов.
    </p>
    <p class="dy58-help-paragraph">
      Временной промежуток поиска информации: этот месяц (по умолчанию) либо иной промежуток времени, который можно
      установить вручную. При ручном задании времени поиска информации левую границу интервала поиска данных
      указывать обязательно, правую - нет. Если правая временная граница не указана и не установлен флаг
      "по настоящее время" либо флаг "по настоящее время" установлен, то полагается, что необходимо найти все документы,
      удовлетворяющие указанным дополнительным критериям поиска начиная с указанного времени.
    </p>
    <p class="dy58-help-paragraph">
      Критерии включения документов следующие: только исходящие документы - будут включены только документы, изданные
      на текущем рабочем полигоне; действующие цепочки документов - будут включены те цепочки документов, время
      которых (цепочек) находится в указанном временном промежутке.
    </p>
    <p class="dy58-help-paragraph">
      Панель поиска дополнительно содержит кнопки <i><b>"Найти"</b></i> и <i><b>"Печать"</b></i>.
      Первая запускает поиск информации, удовлетворяющей указанным критериям, вторая делает то же самое, но с выводом
      результата в отдельном окне, при этом на странице присутствует только таблица с результатами поиска, которую
      можно вывести на печать средствами браузера.
    </p>
    <to-help-start-block />
  </div>
</template>

<script>
  import ToHelpStartBlock from './ToHelpStartBlock';

  export default {
    name: 'dy58-journal-page-description',

    components: {
      ToHelpStartBlock,
    },
  }
</script>
