<template>
  <div>
    <h3 id="main-menu-description" class="dy58-help-contents-item">Главное меню системы</h3>
    <p class="dy58-help-paragraph">
      Главное меню системы расположено в верхней части любой страницы. Предназначено оно для навигации
      по страницам ДУ-58. Пункты главного меню:
    </p>
    <p class="dy58-help-paragraph">
      <i><b>Главная страница</b></i> - переход к главной странице системы; числа, расположенные рядом с
      наименованием пункта меню, определяют количество входящих уведомлений (первое число) и документов,
      находящихся в работе (второе число)
    </p>
    <p class="dy58-help-paragraph">
      <i><b>Создать</b></i> - переход к странице создания документа (распоряжения, заявки, приказа и т.д.)
    </p>
    <p class="dy58-help-paragraph">
      <i><b>Журнал</b></i> - переход к странице журнала ДУ-58
    </p>
    <p class="dy58-help-paragraph">
      <i><b>Рабочий полигон</b></i> - переход к странице с информацией о структуре текущего рабочего полигона
    </p>
    <p class="dy58-help-paragraph">
      <i><b>Персонал</b></i> - переход к странице с информацией о персонале рабочего полигона
    </p>
    <p class="dy58-help-paragraph">
      <i><b>Шаблоны документов</b></i> - переход к странице просмотра/создания/редактирования информации
      о шаблонах документов
    </p>
    <p class="dy58-help-paragraph">
      <i><b>Помощь</b></i> - переход к странице руководства пользователя ДУ-58
    </p>
    <p class="dy58-help-paragraph">
      <i><b>Выход</b></i> - выход из системы
    </p>
    <p class="dy58-help-paragraph">
      В правой части главного меню размещается <i><b>блок с краткой информацией о текущем пользователе</b></i>.
      При нажатии на данный блок появляется диалоговое окно с полной информацией о текущем пользователе.
      Если блок с краткой информацией о текущем пользователе в главном меню серый, значит, текущий
      пользователь находится на дежурстве. Если оранжевый, то пользователь не на дежурстве. Если цвет блока
      красный, то ДУ-58 работает автономно. Если красный мигающий, то ДУ-58 работает автономно, но восстановлена
      связь с сервером, у пользователя есть возможность войти в систему со своими полномочиями.
    </p>
  </div>
</template>

<script>
  export default {
    name: 'dy58-main-menu-description',
  }
</script>
