<template>
  <div>
    <h3 id="main-page-description" class="dy58-help-contents-item">Главная страница</h3>

    <h4 id="side-menu-description" class="dy58-help-contents-item">Боковое меню</h4>
    <p class="dy58-help-paragraph">
      Боковое меню предназначено для отображения статистики по оперативной информации, перехода к форме
      создания (редактирования) документа о приеме-сдаче дежурства и редактирования настроек системы.
    </p>
    <p class="dy58-help-paragraph">
      Пункты меню:
    </p>
    <p class="dy58-help-paragraph">
      <img :src="require('@/assets/img/takePassDuty.png')" class="dy58-help-img-style" />
      - переход на форму создания циркулярного распоряжения (в случае ДНЦ)
      либо создание записи о приеме-сдаче дежурства (в случае ДСП);
      только для пользователя, находящегося на дежурстве!
    </p>
    <p class="dy58-help-paragraph">
      <img :src="require('@/assets/img/editTakePassDuty.png')" class="dy58-help-img-style" />
      - только для находящегося на дежурстве ДСП: переход к форме редактирования текущей записи
      о приеме-сдаче дежурства (созданной текущим пользователем)
    </p>
    <p class="dy58-help-paragraph">
      <img :src="require('@/assets/img/incomingOrdersPerShift.png')" class="dy58-help-img-style" />
      - количество документов, созданных и адресованных текущему рабочему полигону с начала приема дежурства
      текущим пользователем (если на значке нет бейджа с числом, то количество таких документов равно нулю)
    </p>
    <p class="dy58-help-paragraph">
      <img :src="require('@/assets/img/notConfirmed.png')" class="dy58-help-img-style" />
      - количество документов в таблице "Входящие уведомления" (если на значке нет бейджа с числом, то
      входящих документов нет)
    </p>
    <p class="dy58-help-paragraph">
      <img :src="require('@/assets/img/ordersInWork.png')" class="dy58-help-img-style" />
      - количество документов в таблице "Документы в работе" (если на значке нет бейджа с числом, то
      документов, находящихся в работе, нет)
    </p>
    <p class="dy58-help-paragraph">
      <img :src="require('@/assets/img/DR.png')" class="dy58-help-img-style" />
      - только для ДНЦ: количество документов с отметкой "ДР" (если на значке нет бейджа с числом,
      то количество таких документов равно нулю)
    </p>
    <p class="dy58-help-paragraph">
      <img :src="require('@/assets/img/N.png')" class="dy58-help-img-style" />
      - только для ДНЦ: количество документов с отметкой "Н" (если на значке нет бейджа с числом, то
      количество таких документов равно нулю)
    </p>
    <p class="dy58-help-paragraph">
      <img :src="require('@/assets/img/P.png')" class="dy58-help-img-style" />
      - только для ДНЦ: количество документов с отметками "ПВ", "ПД", "ПВПД" (если на значке нет бейджа с числом,
      то количество таких документов равно нулю)
    </p>
    <p class="dy58-help-paragraph">
      <img :src="require('@/assets/img/VM.png')" class="dy58-help-img-style" />
      - только для ДНЦ: количество документов с отметкой "ВМ" (если на значке нет бейджа с числом, то
      количество таких документов равно нулю)
    </p>
    <p class="dy58-help-paragraph">
      <img :src="require('@/assets/img/settings.png')" class="dy58-help-img-style" />
      - переход к форме редактирования настроек системы
    </p>
    <to-help-start-block />

    <h4 id="incoming-notifications-description" class="dy58-help-contents-item">Таблица "Входящие уведомления"</h4>
    <p class="dy58-help-paragraph">
      Таблица "Входящие уведомления" предназначена для отображения документов, созданных на рабочем полигоне,
      отличном от текущего, и адресованных текущему рабочему полигону.
      Каждая запись в первом столбце таблицы содержит значок в виде песочных часов. Если он черного цвета
      <img :src="require('@/assets/img/hourglass_black.png')" class="dy58-help-img-style-nobgcolor" />,
      то с момента прихода документа прошло не более 5 минут. Если значок красного цвета
      <img :src="require('@/assets/img/hourglass_red.png')" class="dy58-help-img-style-nobgcolor" />,
      то документ пришел более 5 минут назад.
    </p>
    <p class="dy58-help-paragraph">
      Нажатие на любую строку таблицы приводит к ее выделению. При этом выше таблицы появляется кнопка с надписью
      <i><b>"Подробнее"</b></i>, которая позволяет промотреть всю информацию о пришедшем документе и (если
      пользователь имеет на это право) подтвердить получение документа.
    </p>
    <to-help-start-block />

    <h4 id="orders-in-work-description" class="dy58-help-contents-item">Секция "Документы в работе"</h4>
    <p class="dy58-help-paragraph">
      Секция "Документы в работе" предназначена для отображения оперативных документов текущего рабочего полигона.
      Дата-время начала отображения информации указана под заголовком секции в поле даты-времени.
      При входе пользователя в систему (с принятием либо без принятия дежурства)
      дата-время начала временного интервала извлечения информации о рабочих документах устанавливается
      равной дате-времени входа пользователя в систему. В дальнейшем пользователь может изменить этот параметр.
      Изменения вступают в силу при очередном обновлении информации.
    </p>
    <p class="dy58-help-paragraph">
      Информация о документах, находящихся в работе, представлена как в табличном виде, так и в виде дерева
      (соответствующие вкладки в секции "Документы в работе").
    </p>
    <p class="dy58-help-paragraph">
      <i><b>Табличный вид</b></i> информации о находящихся в работе документах. Данные размещаются в таблице со
      следующими столбцами:
    </p>
    <p class="dy58-help-paragraph">
      - первый столбец - содержит пиктограмму <i class="pi pi-chevron-right"></i>;
      нажатие на данное изображение приводит к "разворачиванию" соответствующего ряда таблицы;
      появляется более детальная информация о документе (см. ниже);
    </p>
    <p class="dy58-help-paragraph">
      - второй столбец - <i><b>"Действия"</b></i> - содержит кнопки, определяющие действия, которые можно выполнить по
      отношению к соответствующему документу:
      <Button
        icon="pi pi-ellipsis-h"
        class="p-button-info p-button-sm p-ml-2 p-mr-1 dy58-order-action-button"
      /> ("Подробнее") - просмотреть всю информацию о документе,
      <Button
        icon="pi pi-times"
        class="p-button-secondary p-button-sm p-mr-1 dy58-order-action-button"
      /> ("Не показывать") - убрать документ из перечня рабочих документов без возможности восстановления его
      в данном перечне; при этом документ не удаляется из журнала распоряжений/документов; функционал доступен
      лишь пользователю (ДСП / ДНЦ / ЭЦД), находящемуся на дежурстве;
      <Button
        icon="pi pi-file"
        class="p-button-success p-button-sm dy58-order-action-button"
      /> ("Создать") - создать документ, связанный с текущим; список документов, которые можно создать в связке
      с текущим, определяется выпадающим списком, появляющимся как результат нажатия на данную кнопку; после
      выбора документа для создания происходит автоматическое перенаправление на страницу "Создать"; более детально
      о создании одного документа в связке с другим можно посмотреть в разделе 'Страница "Создать"' (Таблица 1);
      функционал доступен лишь пользователю (ДСП / ДНЦ / ЭЦД), находящемуся на дежурстве;
    </p>
    <p class="dy58-help-paragraph">
      - третий столбец - <i><b>"Время действия документа"</b></i> - содержит информацию о дате-времени, с которых документ
      полагается действующим в системе и (не всегда) дату-время, начиная с которых документ в системе считается
      окончившим действие либо отметку о действии "до отмены / до уведомления"; принцип формирования значения,
      отображаемого в данном поле, следующий:
      если документ имеет конкретное время начала действия и конкретное время окончания действия,
      причем эти времена равны, либо тип документа "заявка" / "уведомление" / "уведомление ЭЦД", либо
      документ имеет специальную отметку 'ДСП_ПД' (запись о приеме-сдаче дежурства ДСП) / 'ЦР' (циркулярное
      распоряжение ДНЦ), то отображается только время начала действия документа; если документ имеет время
      окончания действия, отличное от времени начала действия, то отображаются два времени; если документ не
      имеет времени окончания действия, то вместо времени окончания действия документа отображается строка
      'до отмены' (для распоряжений ДНЦ) либо строка 'до уведомления' (для приказов ЭЦД и запрещений ЭЦД);
    </p>
    <p class="dy58-help-paragraph">
      - четвертый столбец - <i><b>"Наименование"</b></i> - содержит название документа;
    </p>
    <p class="dy58-help-paragraph">
      - пятый столбец - <i><b>"Статус"</b></i> - содержит информацию о статусе получения и подтверждения документа:
      любой созданный документ, имеющий получателей среди ДСП, ДНЦ, ЭЦД, "ожидает", когда данный документ
      будет получен каждым из адресатов и подтвержден им; для документа, все адресаты которого получили и подтвердили
      получение документа, поле "Статус" будет пусто; в противном случае поле содержит информацию о количестве
      адресатов, которые не получили документ, и/или количестве адресатов, которые не подтвердили данный документ;
      для ДНЦ и ЭЦД вышеуказанная числовая информация отображается в бейджах розового
      <Badge class="dy58-not-delivered-order" value="3"></Badge> и желтого
      <Badge class="dy58-not-confirmed-order" value="2"></Badge> цветов соответственно;
      для ДСП упомянутая информация дополняется аналогичного рода информацией по станции (на скольких рабочих
      местах документ не был получен и/или подтвержден); данная информация следует через знак "/" после информации
      об исходных адресатах: <Badge class="dy58-not-delivered-order" value="0/3"></Badge>,
      <Badge class="dy58-not-confirmed-order" value="1/2"></Badge>.
    </p>
    <to-help-start-block />
  </div>
</template>

<script>
  import ToHelpStartBlock from './ToHelpStartBlock';

  export default {
    name: 'dy58-main-page-description',

    components: {
      ToHelpStartBlock,
    },
  }
</script>
