<template>
  <div>
    <h3 id="main-page-description" class="dy58-help-contents-item">Главная страница</h3>

    <h4 id="side-menu-description" class="dy58-help-contents-item">Боковое меню</h4>
    <p class="dy58-help-paragraph">
      Боковое меню предназначено для:
    </p>
    <p class="dy58-help-paragraph">
      - отображения статистики по оперативной информации,
    </p>
    <p class="dy58-help-paragraph">
      - перехода к форме создания (редактирования) документа о приеме-сдаче дежурства,
    </p>
    <p class="dy58-help-paragraph">
      - редактирования настроек системы.
    </p>
    <p class="dy58-help-paragraph">
      Пункты меню:
    </p>
    <p class="dy58-help-paragraph">
      <img :src="require('@/assets/img/takePassDuty.png')" class="dy58-help-img-style" />
      - переход на форму создания циркулярного распоряжения (в случае ДНЦ/ЭЦД)
      либо создание записи о приеме-сдаче дежурства (в случае ДСП);
      только для пользователя, находящегося на дежурстве!
    </p>
    <p class="dy58-help-paragraph">
      <img :src="require('@/assets/img/editTakePassDuty.png')" class="dy58-help-img-style" />
      - только для находящегося на дежурстве ДСП: переход к форме редактирования текущей записи
      о приеме-сдаче дежурства; редактировать текущую запись о приеме-сдаче дежурства может только ее создатель
    </p>
    <p class="dy58-help-paragraph">
      <img :src="require('@/assets/img/incomingOrdersPerShift.png')" class="dy58-help-img-style" />
      - количество документов, созданных и адресованных текущему рабочему полигону с начала приема дежурства
      текущим пользователем (если на значке нет бейджа с числом, то количество таких документов равно нулю)
    </p>
    <p class="dy58-help-paragraph">
      <img :src="require('@/assets/img/notConfirmed.png')" class="dy58-help-img-style" />
      - количество документов в таблице "Входящие уведомления" (если на значке нет бейджа с числом, то
      входящих документов нет)
    </p>
    <p class="dy58-help-paragraph">
      <img :src="require('@/assets/img/ordersInWork.png')" class="dy58-help-img-style" />
      - количество документов в таблице "Документы в работе" (если на значке нет бейджа с числом, то
      документов, находящихся в работе, нет)
    </p>
    <p class="dy58-help-paragraph">
      <img :src="require('@/assets/img/DR.png')" class="dy58-help-img-style" />
      - только для ДНЦ: количество документов с отметкой "ДР" (если на значке нет бейджа с числом,
      то количество таких документов равно нулю); находящийся на дежурстве ДНЦ может использовать эту кнопку
      для быстрого перехода на форму создания распоряжения о поезде, идущем ДР (если существует шаблон с отметкой ДР)
    </p>
    <p class="dy58-help-paragraph">
      <img :src="require('@/assets/img/N.png')" class="dy58-help-img-style" />
      - только для ДНЦ: количество документов с отметкой "Н" (если на значке нет бейджа с числом, то
      количество таких документов равно нулю); находящийся на дежурстве ДНЦ может использовать эту кнопку
      для быстрого перехода на форму создания распоряжения о негабаритном поезде (если существует шаблон с отметкой Н)
    </p>
    <p class="dy58-help-paragraph">
      <img :src="require('@/assets/img/P.png')" class="dy58-help-img-style" />
      - только для ДНЦ: количество документов с отметками "ПВ", "ПД", "ПВД" (если на значке нет бейджа с числом,
      то количество таких документов равно нулю); находящийся на дежурстве ДНЦ может использовать эту кнопку
      для быстрого перехода на форму создания распоряжения о поезде повышенного веса / повышенной длины /
      повышенного веса и повышенной длины (если существует шаблон с отметкой ПВ/ПД/ПВД)
    </p>
    <p class="dy58-help-paragraph">
      <img :src="require('@/assets/img/VM.png')" class="dy58-help-img-style" />
      - только для ДНЦ: количество документов с отметкой "ВМ" (если на значке нет бейджа с числом, то
      количество таких документов равно нулю); находящийся на дежурстве ДНЦ может использовать эту кнопку
      для быстрого перехода на форму создания распоряжения о поезде со взрывчатыми материалами (если существует шаблон с отметкой ВМ)
    </p>
    <p class="dy58-help-paragraph">
      <img :src="require('@/assets/img/drafts.png')" class="dy58-help-img-style" />
      - только для находящегося на дежурстве ЭЦД: отображение количества черновиков документов
      (если на значке нет бейджа с числом, то черновиков нет) и переход к форме черновиков документов;
      на данной форме отображается список всех созданных черновиков документов, с группировкой их по
      типам документов; при выделении записи в списке появляются кнопки действий, которые можны совершить
      по отношению к выделенному черновику документа:
      <Button icon="pi pi-file" class="p-button-success p-button-sm dy58-order-action-button p-mr-2" /> -
      редактировать черновик либо издать на его основе документ,
      <Button icon="pi pi-times" class="p-button-secondary p-button-sm dy58-order-action-button" /> -
      удалить выбранный черновик
    </p>
    <p class="dy58-help-paragraph">
      <img :src="require('@/assets/img/settings.png')" class="dy58-help-img-style" />
      - переход к форме редактирования настроек системы (в настоящее время настройка у системы только
      одна: громкость звуковых оповещений о наличии входящих уведомлений)
    </p>

    <h4 id="dsp-take-pass-order-description" class="dy58-help-contents-item">Запись о приеме-сдаче дежурства ДСП</h4>
    <p class="dy58-help-paragraph">
      Создать / отредактировать в журнале распоряжений запись о приеме-сдаче дежурства ДСП может с
      главной страницы ДУ-58 (см. выше описание кнопок бокового меню).
      Делать запись о приеме-сдаче дежурства должен принимающий дежурство работник "главного" рабочего места ДУ-58 на станции
      (рабочее место ответственного за ДУ-58 в рамках станции)!
      Если это сделает работник, сдающий дежурство, то принявший впоследствии дежурство работник не сможет произвести
      редактирование созданной записи. Оператор при ДСП (т.е. работник "дополнительного" рабочего места на станции не может
      делать запись о приеме-сдаче дежурства).
    </p>
    <p class="dy58-help-paragraph">
      В диалоговом окне создания / редактирования записи о приеме-сдаче дежурства обязательно
      заполнение следующих полей:
    </p>
    <p class="dy58-help-paragraph">
      <i><b>Номер</b></i> - правила заполнения данного поля см. в разделе "Страница 'Создать'"
      (описание правил заполнения поля номера издаваемого документа). Важно учитывать, что тип документа
      "запись о приеме-сдаче дежурства" в системе - распоряжение! Если производится редактирование
      записи о приеме-сдаче дежурства, то значение в данном поле изменить нельзя.
    </p>
    <p class="dy58-help-paragraph">
      <i><b>Дата и время создания</b></i> - правила заполнения данного поля см. в разделе "Страница 'Создать'"
      (описание правил заполнения поля даты и времени создания документа). Если производится редактирование
      записи о приеме-сдаче дежурства, то значение в данном поле не меняется.
    </p>
    <p class="dy58-help-paragraph">
      <i><b>Дежурство сдал</b></i> - должность и ФИО лица, сдающего дежурство. Если создается новая запись
      о приеме-сдаче дежурства, то при наличии предыдущей записи о приеме-сдаче дежурства значение данного поля
      будет заполняться автоматически путем проставления должности и ФИО лица, которое фигурирует в предыдущей
      записи как лицо, принявшее дежурство.
    </p>
    <p class="dy58-help-paragraph">
      <i><b>Время сдачи дежурства</b></i> - дата и время, когда пользователь сдает дежурство. По умолчанию
      для новой записи о приеме-сдаче дежурства значение в данном поле будет равно 8:00 текущего дня для
      дневной смены и 20:00 текущего дня для ночной смены. При изменении значения в данном поле происходит
      автоматическое проставление устанавливаемого значения во ВСЕХ полях даты-времени, расположенных ниже!
    </p>
    <p class="dy58-help-paragraph">
      <i><b>Дежурство принял</b></i> - должность и ФИО лица, принимающего дежурство. Если создается новая запись
      о приеме-сдаче дежурства, то в качестве такого лица выступает работник, который в данный момент
      работает с ДУ-58.
    </p>
    <p class="dy58-help-paragraph">
      <i><b>Время приема дежурства</b></i> - дата и время, когда пользователь принимает дежурство.
    </p>
    <p class="dy58-help-paragraph">
      Необязательными для заполнения являются следующие поля:
      информация о работниках, принимающих дежурство на других рабочих местах этой же станции;
      дополнительная информация.
    </p>

    <h4 id="incoming-notifications-description" class="dy58-help-contents-item">Таблица "Входящие уведомления"</h4>
    <p class="dy58-help-paragraph">
      Таблица "Входящие уведомления" предназначена для отображения документов, адресованных текущему рабочему месту.
      Каждая запись в первом столбце таблицы содержит значок в виде песочных часов. Если он черного цвета
      <img :src="require('@/assets/img/hourglass_black.png')" class="dy58-help-img-style-nobgcolor" />,
      то с момента прихода документа прошло не более 5 минут. Если значок красного цвета
      <img :src="require('@/assets/img/hourglass_red.png')" class="dy58-help-img-style-nobgcolor" />,
      то документ пришел более 5 минут назад.
    </p>
    <p class="dy58-help-paragraph">
      Нажатие на любую строку таблицы приводит к ее выделению (снять выделение можно путем нажатия на строку таблицы с
      удержанием клавиши Ctrl). При этом выше таблицы появляется кнопка с надписью
      <i><b>"Подробнее"</b></i>, которая позволяет промотреть всю информацию о пришедшем документе и (если
      пользователь имеет на это право) подтвердить получение документа (вызвать диалог просмотра / подтверждения
      можно также двойным щелчком мыши по нужной строке таблицы). Подтвержденный документ переходит в секцию
      "Документы в работе" (см. ниже).
    </p>
    <p class="dy58-help-paragraph">
      Неподтвержденный документ будет находиться в таблице входящих уведомлений максимум 30 дней.
    </p>

    <h4 id="orders-in-work-description" class="dy58-help-contents-item">Секция "Документы в работе"</h4>
    <p class="dy58-help-paragraph">
      Секция "Документы в работе" предназначена для отображения оперативных документов текущего рабочего полигона.
    </p>
    <div class="dy58-help-definition">
      <p class="dy58-help-text">
        Под <i><b>оперативными</b></i> понимаются <i><b>документы</b></i>, для которых время действия последнего
        документа в их цепочке (подробнее о цепочках документов см. в разделе "Страница 'Создать'") не закончилось
        либо попадает во временной промежуток, в течение которого распоряжение считается находящимся в работе
        (от времени начала действия документа в системе прошло не более 8 часов).
      </p>
    </div>
    <p class="dy58-help-text">
      Время начала отображения информации указано под заголовком секции в поле даты-времени.
      Это значение устанавливается при входе пользователя в систему (с принятием либо без принятия дежурства)
      и зависит от времени суток: если пользователь входит в систему с 7:30 до 19:30, то время начала отображения
      информации равно 7:00 этого же дня; если пользователь входит в систему ранее 7:30, то время запроса
      информации устанавливается равным 19:00 предыдущего дня; в противном случае время начала запроса информации
      устанавливается равным 19:00 этого же дня.
      Время начала запроса оперативных документов можно изменить вручную.
      Изменения вступают в силу при очередном обновлении информации.
    </p>
    <p class="dy58-help-paragraph">
      Информация о документах, находящихся в работе, представлена как в табличном виде, так и в виде дерева
      (соответствующие вкладки в секции "Документы в работе").
    </p>
    <br />
    <p class="dy58-help-paragraph">
      <i><b>Табличный вид</b></i> информации о находящихся в работе документах. Данные размещаются в таблице со
      следующими столбцами:
    </p>
    <p class="dy58-help-paragraph">
      - первый столбец - содержит пиктограмму <i class="pi pi-chevron-right" style="text-indent:0"></i>;
      нажатие на данное изображение приводит к "разворачиванию"/"сворачиванию" соответствующего ряда таблицы
      (аналогичного эффекта можно добиться двойным щелчком мыши по ряду);
      появляется более детальная информация о документе (см. описание содержимого <i><b>"расширения строки"</b></i> ниже);
    </p>
    <p class="dy58-help-paragraph">
      - второй столбец - <i><b>"Действия"</b></i> - содержит кнопки, определяющие действия, которые можно выполнить по
      отношению к соответствующему документу:
    </p>
    <p class="dy58-help-text">
      <Button
        icon="pi pi-ellipsis-h"
        class="p-button-info p-button-sm p-mr-1 dy58-order-action-button"
      /> ("Подробнее") - просмотреть всю информацию о документе,
    </p>
    <p class="dy58-help-text">
      <Button
        icon="pi pi-times"
        class="p-button-secondary p-button-sm p-mr-1 dy58-order-action-button"
      /> ("Не показывать / Не показывать цепочку") - убрать документ (цепочку свяанных документов) из перечня
      рабочих документов без возможности восстановления его в данном перечне;
      при этом документ не удаляется из журнала распоряжений / документов;
      функционал доступен лишь пользователю (ДНЦ / ЭЦД / ДСП / Оператор при ДСП), находящемуся на дежурстве;
      более подробно о цепочках документов см. раздел "Страница 'Создать'";
    </p>
    <p class="dy58-help-text">
      <Button
        icon="pi pi-file"
        class="p-button-success p-button-sm dy58-order-action-button"
      /> ("Создать") - создать документ, связанный с текущим; список документов, которые можно создать в связке
      с текущим, определяется выпадающим списком, появляющимся как результат нажатия на данную кнопку; после
      выбора документа для создания происходит автоматическое перенаправление на страницу "Создать"; более детально
      о создании одного документа в связке с другим можно посмотреть в разделе 'Страница "Создать"' (Таблица 1);
      функционал доступен лишь пользователю (ДНЦ / ЭЦД / ДСП / Оператор при ДСП), находящемуся на дежурстве;
    </p>
    <p class="dy58-help-paragraph">
      - третий столбец - <i><b>"Номер"</b></i> - содержит номер соответствующего документа; для документов, изданных
      на текущем рабочем полигоне, номер отображается в
      <span class="dy58-order-dispatched-on-this-global-poligon">светло-зеленом</span> прямоугольнике;
      если за номером документа следует знак * (звездочка), то такой документ принадлежит цепочке из более чем одного документа
      (более подробно о цепочках документов см. раздел "Страница 'Создать'"); если документ - копия, то
      соответствующая запись (<span class="dy58-order-copy">оранжевого цвета</span>) будет следовать за номером документа;
    </p>
    <p class="dy58-help-paragraph">
      - четвертый столбец - <i><b>"Время действия в системе"</b></i> - содержит информацию о дате-времени, с которых документ
      полагается действующим в системе и (не всегда) дату-время, начиная с которых документ в системе считается
      окончившим действие либо отметку о действии "до отмены / до уведомления"; принцип формирования значения,
      отображаемого в данном поле, следующий:
    </p>
    <p class="dy58-help-text">
      <ul class="dy58-help-paragraph dy58-help-list">
        <li>
          если документ имеет конкретное время начала действия и конкретное время окончания действия,
          причем эти времена равны, либо тип документа "заявка" / "уведомление" / "уведомление ЭЦД", либо
          документ имеет специальную отметку 'ДСП_ПД' (запись о приеме-сдаче дежурства ДСП) / 'ЦР' (циркулярное
          распоряжение ДНЦ/ЭЦД), то отображается только время начала действия документа;
        </li>
        <li>
          если документ имеет время окончания действия, отличное от времени начала действия, то отображаются два времени;
        </li>
        <li>
          если документ не имеет времени окончания действия, то вместо времени окончания действия документа отображается строка
          'до отмены' (для распоряжений ДНЦ) либо строка 'до уведомления' (для приказов ЭЦД и запрещений ЭЦД).
        </li>
      </ul>
    </p>
    <p class="dy58-help-text">
      Вся информация в таблице "Документы в работе" отсортирована в порядке уменьшения значения в поле
      "Время действия в системе" (т.е. в обратном хронологическим порядке).
    </p>
    <p class="dy58-help-paragraph">
      - пятый столбец - <i><b>"Наименование"</b></i> - содержит название документа и может содержать краткую информацию о нем;
    </p>
    <p class="dy58-help-paragraph">
      - шестой столбец - <i><b>"Статус"</b></i> - содержит информацию о статусе получения и подтверждения документа:
      любой созданный документ, имеющий получателей среди ДСП, ДНЦ, ЭЦД, "ожидает", когда данный документ
      будет получен каждым из адресатов и подтвержден им; для документа, все адресаты которого получили и подтвердили
      получение документа, поле "Статус" будет пусто; в противном случае поле содержит информацию о количестве
      адресатов, которые не получили документ, и/или количестве адресатов, которые не подтвердили данный документ;
      для ДНЦ и ЭЦД вышеуказанная числовая информация отображается в бейджах розового
      <Badge class="dy58-not-delivered-order" style="text-indent:0" value="3"></Badge> и желтого
      <Badge class="dy58-not-confirmed-order" style="text-indent:0" value="2"></Badge> цветов соответственно;
      для ДСП упомянутая информация дополняется аналогичного рода информацией по станции (на скольких рабочих
      местах документ не был получен и/или подтвержден); данная информация следует через знак "/" после информации
      об исходных адресатах: <Badge class="dy58-not-delivered-order" style="text-indent:0" value="0/3"></Badge>,
      <Badge class="dy58-not-confirmed-order" style="text-indent:0" value="1/2"></Badge>.
    </p>
    <p class="dy58-help-paragraph">
      <i><b>"Расширение строки"</b></i> каждой конкретной строки таблицы "Документы в работе" содержит тест документа,
      список его адресатов, времена подтверждения получения документа адресатами и время утверждения документа.
      Текст документа располагается слева. В него включается краткая информация об адресатах.
      Более подробная информация об адресатах документа (включены сведения о доставке / подтверждении документа) размещается
      справа от текста документа: таблицы "Адресаты" (см. ниже), "Получатели на станции" (см. ниже), текстовая информация
      о подтверждении документа "иными" адресатами (см. ниже).
    </p>
    <p class="dy58-help-paragraph">
      В таблице <i><b>"Адресаты"</b></i> на всех полигонах управления приведена информация об основных адресатах
      документа из числа ДСП, ДНЦ и ЭЦД. Данная таблица позволяет увидеть статус документа по
      конкретному рабочему полигону (получен ли документ на данном полигоне, подтвержден ли он на нем).
      Цвет строки таблицы определяется статусом документа на рабочем полигоне-адресате и совпадает с цветом соответствующего
      статуса документа (см. описание столбца "Статус" таблицы "Документы в работе" выше).
      Если строка таблицы "Адресаты" белого цвета, то на соответствующем рабочем полигоне документ был подтвержден.
    </p>
    <p class="dy58-help-paragraph">
      У всех ДСП справа от текста документа присутствует также таблица <i><b>"Получатели на станции"</b></i>.
      В данной таблице размещается информация по получателям документа в рамках станции. Принцип ее отображения аналогичен
      принципу отображения информации в таблице "Адресаты". Если на станции только один (основной) адресат, то таблица
      "Получатели на станции" будет содержать одну строку.
    </p>
    <p class="dy58-help-paragraph">
      Помимо таблиц "Адресаты" и "Получатели на станции", справа от текста документа в "расширении строки" записи
      таблицы "Документы в работе" может присутствовать строка с информацией об отсутствии подтверждения документа
      со стороны "иных" адресатов (т.е. адресатов, отличных от ДСП, ДНЦ и ЭЦД) - тех, которые фигурируют в тексте
      документа, но не имеют рабочего места в ДУ-58. Подтвердить документ за данных адресатов может лишь работник
      рабочего полигона-создателя документа.
    </p>
    <p class="dy58-help-paragraph">
      Если документ издан на текущем рабочем полигоне, то запись таблицы "Адресаты" в столбце "Подтверждение"
      для конкретной записи может содержать кнопку
      <Button
        icon="pi pi-check"
        class="p-button-info p-button-sm dy58-order-action-button"
      /> "Подтвердить". Она будет присутствовать до тех пор пока документ не будет подтвержден на соответствующем
      рабочем полигоне-адресате. Работник полигона-издателя распоряжения имеет право самостоятельно осуществить
      подтверждение документа за полигон-адресат путем нажатия на кнопку "Подтвердить". При этом дата-время подтверждения
      документа полагается равной текущей дате-времени. Если необходимо подтвердить документ сразу за все
      рабочие полигоны, где документ еще не подтвержден, то под таблицей "Адресаты" для этой цели присутствует
      кнопка "Подтвердить все". Подтверждение экземпляра документа за иное лицо фиксируется системой: в графе
      "Подтверждение", помимо времени подтверждения документа, будут указаны должность и ФИО лица, осуществившего
      подтверждение.
    </p>
    <p class="dy58-help-paragraph">
      Работа с таблицей "Получатели на станции" в части подтверждения документа за иных лиц аналогична работе с таблицей
      "Адресаты" (за исключением фиксации факта подтверждения документа за иное лицо).
      Если документ пришел с иного рабочего полигона (т.е. не был создан на данной станции), то подтвердить
      документ за работников станции имеет право лишь пользователь "главного" рабочего места системы ДУ-58 на станции.
      Если документ издан в рамках станции, то подтвердить его за других работников станции имеет право лишь работник
      того рабочего места, на котором документ был создан. Лицо, имеющее право на подтверждение документа за работников
      станции, может, не подтверждая документ за иное лицо, удалить данное лицо из списка получателей документа на
      станции (кнопка
      <Button
        icon="pi pi-times"
        class="p-button-secondary p-button-sm dy58-order-action-button p-m-1"
      /> "Удалить" записи таблицы "Получатели на станции"). Это приведет к тому, что документ не будет отображаться
      в списке входящих уведомлений на соответствующем рабочем месте станции (в списке документов, находящихся в
      работе, его тоже не будет).
    </p>
    <br />
    <p class="dy58-help-paragraph">
      Помимо табличного представления информации о находящихся в работе документах, секция "Документы в работе" содержит
      представление этой же информации <i><b>в виде дерева</b></i>. Наличие древовидного представления информации
      обусловлено наличием <i><b>логики связывания документов в системе</b></i>. Описание логики связывания
      документов приведено в разделе "Страница 'Создать'". Выделение записи в дереве приводит к появлению кнопок действий,
      которые можно выполнить по отношению к соответствующему документу. Данные кнопки аналогичны кнопкам, содержащимся
      в столбце "Действия" таблицы "Документы в работе" (см. выше).
      Документы в дереве так же, как и в таблице, отсортирована в порядке уменьшения времени действия документов в системе,
      но под документами в данном случае понимаются лишь те их них, которые являются началом соответствующей цепочки
      документов (в рамках цепочки документы сортируются в прямом хронологическом порядке).
    </p>
  </div>
</template>

<script>
  export default {
    name: 'dy58-main-page-description',
  }
</script>

<style scoped>
  .dy58-help-list li {
    list-style-type: disc;
    list-style-position: inside;
  }
</style>
