<template>
  <div>
    <h3 id="order-patterns-page-description" class="dy58-help-contents-item">Страница "Шаблоны документов"</h3>
    <p class="dy58-help-paragraph">
      На данной странице есть возможность просмотреть все существующие и используемые ДУ-58 шаблоны документов.
      Шаблоны сгруппированы по типам документов и группам документов в рамках типов.
      Соответствующее дерево групп с шаблонами расположено в левой части страницы.
    </p>
    <p class="dy58-help-paragraph">
      При выборе шаблона в дереве его текст отображается в правой части страницы.
    </p>
    <p class="dy58-help-paragraph">
      Над деревом шаблонов расположено поле поиска по дереву шаблонов. При вводе строки в данное поле автоматически
      скрываются те узлы дерева, в названии которых (а также в названии подузлов которых) не содержится указанная
      строка. Поиск не чувствителен к регистру вводимых симоволов.
    </p>
  </div>
</template>

<script>
  export default {
    name: 'dy58-order-patterns-page-description',
  }
</script>
