<template>
  <div>
    <h3 id="order-patterns-page-description" class="dy58-help-contents-item">Страница "Шаблоны документов"</h3>
    <p class="dy58-help-paragraph">
      На данной странице есть возможность просмотреть все существующие и используемые ДУ-58 для текущего пользователя
      на текущем рабочем полигоне шаблоны документов.
      Шаблоны сгруппированы по типам документов (распоряжение, заявка и т.д.) и группам документов в рамках типов.
      Соответствующее дерево групп с шаблонами расположено в левой части страницы.
    </p>
    <p class="dy58-help-paragraph">
      При выборе шаблона в дереве его текст отображается в правой части страницы.
    </p>
    <p class="dy58-help-paragraph">
      Рядом с узлом дерева, содержащим название шаблона документа, присутствует пиктограмма, определяющая возможность
      пользователя редактировать соответствующий шаблон: если пиктограмма вида <span class="pi pi-file dy58-in-text-icon" />,
      то пользователь имеет право редактировать шаблон документа, если <i class="pi pi-file-excel dy58-in-text-icon"/> - не имеет.
    </p>
    <p class="dy58-help-paragraph">
      Администратор системы имеет возможность сортировать шаблоны в рамках соответствующих типов документов.
      Порядок сортировки учитывается системой ДУ-58 при отображении шаблонов в списках выбора.
      Для вновь созданного шаблона место его среди шаблонов документов того же типа полагается неизвестным по умолчанию.
      Если администратор системы не укажет место шаблона явно, то такой шаблон будет размещаться в конце списка документов
      своего типа в дереве шаблонов, а его название будет красного цвета. Если название шаблона черного цвета, то для него
      администратор явно определил место среди шаблонов того же типа.
    </p>
    <p class="dy58-help-paragraph">
      Над деревом шаблонов расположено поле поиска по дереву шаблонов. При вводе строки в данное поле автоматически
      скрываются те (под-)узлы дерева, в названии которых не содержится указанная строка.
      Поиск не чувствителен к регистру вводимых симоволов.
    </p>
  </div>
</template>

<script>
  export default {
    name: 'dy58-order-patterns-page-description',
  }
</script>

<style scoped>
  .dy58-in-text-icon {
    margin-left: -22px;
  }
</style>
