<template>
  <div>
    <h3 id="personal-page-description" class="dy58-help-contents-item">Страница "Персонал"</h3>
    <p class="dy58-help-paragraph">
      На данной странице представлена информация о персонале рабочего полигона и связанных рабочих полигонов
      (см. раздел "Страница 'Рабочий полигон'"). Информация о персонале подгружается в момент входа пользователя
      в систему после того как будет загружена информация о структуре рабочего полигона и связанных с ним
      рабочих полигонов.
    </p>
    <p class="dy58-help-paragraph">
      Синим и зеленым цветом отмечены лица, которые в данный момент пользуются системой ДУ-58 (online-пользователи).
      При этом отмеченные синим цветом пользователи вошли в систему без принятия дежурства, а отмеченные зеленым
      цветом пользователи вошли в систему с принятием дежурства.
      Если лицо отмечено красным цветом, то оно зарегистрировано на соответствующем рабочем полигоне, но не наделено
      администратором системы полномочием ДНЦ / ЭЦД / ДСП / Оператора при ДСП.
    </p>
    <p class="dy58-help-paragraph">
      Пользователи системы из числа ДНЦ, ЭЦД, ДСП, Операторов при ДСП используются в ДУ-58 для формирования списков
      адресатов документов, а также при формировании распоряжений о приеме-сдаче дежурства ДСП.
    </p>
  </div>
</template>

<script>
  export default {
    name: 'dy58-personal-page-description',
  }
</script>
