<template>
  <div>
    <h3 id="system-exit-description" class="dy58-help-contents-item">Выход из системы</h3>
    <p class="dy58-help-paragraph">
      Выход из системы означает локальное удаление всех полномочий, которые пользователь получил в момент
      входа в систему. После выхода из системы работа с ДУ-58 становится невозможной до следующего входа
      в систему.
    </p>
    <p class="dy58-help-paragraph">
      Если вход в систему осуществлен таким образом, что пользователь считается находящимся на дежурстве, то
      пункт главного меню ДУ-58 <i><b>"Выход"</b></i> содержит два подпункта: <i><b>"Без сдачи дежурства"</b></i>,
      <i><b>"Со сдачей дежурства"</b></i>.
    </p>
    <p class="dy58-help-paragraph">
      Выбирая подпункт <i><b>"Без сдачи дежурства"</b></i>, пользователь может выйти из системы с возможностью последующего
      входа в нее без принятия дежурства. При этом он будет считаться на дежурстве, время принятия дежурства -
      то время, которое было зафиксировано в момент входа в систему с установленным флагом "Принять дежурство".
      Это возможно благодаря тому что при выходе из системы без сдачи дежурства на сервере не отмечается факт
      сдачи дежурства.
    </p>
    <p class="dy58-help-paragraph">
      Если пользователь выбирает подпункт <i><b>"Со сдачей дежурства"</b></i>, то осуществляется выход из
      системы с отметкой на сервере факта сдачи дежурства.
    </p>
    <to-help-start-block />
  </div>
</template>

<script>
  import ToHelpStartBlock from './ToHelpStartBlock';

  export default {
    name: 'dy58-system-exit-description',

    components: {
      ToHelpStartBlock,
    },
  }
</script>
