<template>
  <div>
    <h3 id="system-enter-description" class="dy58-help-contents-item">Вход в систему</h3>
    <p class="dy58-help-paragraph">
      Вход в систему означает получение определенных полномочий для работы с ДУ-58.
      Полномочия устанавливаются/утверждаются Администратором системы.
      Полномочия, которые доступны для работы в системе ДУ-58:
    </p>
    <p class="dy58-help-paragraph">
      DNC_FULL - полномочия ДНЦ
    </p>
    <p class="dy58-help-paragraph">
      DSP_FULL - полномочия ДСП (работника "главного" рабочего места ДУ-58 в рамках станции: именно с этого рабочего места
      ожидаются подтверждения документов, адресованных станции)
    </p>
    <p class="dy58-help-paragraph">
      DSP_Operator - полномочия Оператора при ДСП (работника "дополнительного" рабочего места ДУ-58 на станции)
    </p>
    <p class="dy58-help-paragraph">
      ECD_FULL - полномочия ЭЦД
    </p>
    <p class="dy58-help-paragraph">
      REVISOR - полномочия Ревизора
    </p>
    <p class="dy58-help-paragraph">
      Полномочия связаны с аутентификационными данными - Именем пользователя и Паролем - которые
      необходимы для работы с ДУ-58.
      За одним пользователем может быть закреплено несколько полномочий. В этом случае он сможет работать
      на нескольких рабочих полигонах.
    </p>
    <p class="dy58-help-paragraph">
      Вход в систему без принятия дежурства означает возможность работы с данными на соответствующем рабочем
      полигоне без возможности их редактирования и удаления.
    </p>
    <p class="dy58-help-paragraph">
      Для полноценной работы с ДУ-58 на конкретном рабочем полигоне необходимо при входе в систему установить
      флаг <i><b>"Принять дежурство"</b></i>. При этом на сервере отмечается факт принятия дежурства вошедшим
      в систему пользователем. Если в этот момент другой пользователь с аналогичными полномочиями
      находится на дежурстве на этом же рабочем полигоне, то он автоматически снимается с дежурства
      (на сервере делается отметка о сдаче им дежурства). Принятие дежурства без сдачи предыдущей смены не
      допускается, система уведомит об этом сообщением "Пользователь на дежурстве".
    </p>
    <p class="dy58-help-paragraph">
      Если пользователь выходит из системы, не сдавая дежурство, то в дальнейшем он может войти в систему,
      не принимая дежурство, при этом система будет считать его находящимся на дежурстве.
      На сервере не делается никаких отметок о принятии/сдаче дежурства.
    </p>
    <p class="dy58-help-paragraph">
      Если пользователь имеет право работать на нескольких рабочих полигонах, то после процедуры успешной
      аутентификации система предложит ему выбрать рабочий полигон.
    </p>
  </div>
</template>

<script>
  export default {
    name: 'dy58-system-enter-description',
  }
</script>
